---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SweepFailures.ProfileLoopEmpty
source: html/a73d2cc2-7965-a291-ae63-be81ba015b0d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SweepFailures.ProfileLoopEmpty Property

Profile sketch is empty!

## Syntax (C#)
```csharp
public static FailureDefinitionId ProfileLoopEmpty { get; }
```